### 1. How to import pandas and check the version?

In [2]:
import pandas as pd
print(pd.__version__)

1.1.5

### 2. How to create a series from a list, numpy array and dict?
Create a pandas series from each of the items below: a list, numpy and a dictionary

In [3]:
# Input
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [7]:
mylist_series = pd.Series(mylist) 
myarr_series = pd.Series(np.arange(26))
mydict_series = pd.Series(dict(zip(mylist, myarr)))

#### 2.1. Creating Pandas DataFrame from lists of lists.

In [21]:
pd.DataFrame([['tom',10],['nick',20],['ana',30]], columns=['Name','Age']) # df created rowwise

   Name  Age
0   tom   10
1  nick   20
2   ana   30

#### 2.2. Creating DataFrame from dict of narray/lists

In [22]:
data = {'Name': ['tom', 'nick', 'ana'],
        'Age': [10, 20, 30]}
pd.DataFrame(data)

   Name  Age
0   tom   10
1  nick   20
2   ana   30

#### 2.3. Creates a indexes DataFrame using arrays.

In [24]:
data = {'Name': ['tom', 'nick', 'ana'],
        'Age': [10, 20, 30]}
pd.DataFrame(data, index=['rank1', 'rank2', 'rank3'])

       Name  Age
rank1   tom   10
rank2  nick   20
rank3   ana   30

#### 2.4. Creating Dataframe from list of dicts

In [28]:
data = [{'a':10, 'b':20, 'c':30},
        {'a':5, 'b':15, 'c':25}]
pd.DataFrame(data)

    a   b   c
0  10  20  30
1   5  15  25

### 3. How to convert the index of a series into a column of a dataframe?
Difficulty Level: L1

Convert the series ser into a dataframe with its index as another column on the dataframe.

In [11]:
# Input
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [29]:
df = ser.to_frame().reset_index()
df.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

### 4. How to combine many series to form a dataframe?
Difficulty Level: L1

Combine ser1 and ser2 to form a dataframe.

In [30]:
# Input

import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [35]:
# Solution 1
df = pd.DataFrame({'col1':ser1, 'col2':ser2})
df.head(2)

  col1  col2
0    a     0
1    b     1

In [38]:
# Solution 2
df = pd.concat([ser1,ser2], axis=1)
df.head(2)

   0  1
0  a  0
1  b  1

### 5. How to assign name to the series’ index?
Difficulty Level: L1

Give a name to the series ser calling it ‘alphabets’.

In [39]:
# Input

ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [42]:
ser = pd.Series(ser, name='alphabets')
ser.head(2)

# The name of a Series becomes its index or column name if used to form a Data Frame

0    a
1    b
Name: alphabets, dtype: object

### 6. How to get the items of series A not present in series B?
Difficulty Level: L2

From ser1 remove items present in ser2.

In [52]:
# Input 
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [46]:
set(ser1) - set(ser2)

{1, 2, 3}

In [47]:
pd.Series([i for i in ser1 if i not in ser2])
# Wrong!!! Because *in* is interpreted as: i in ser._info_axis, the Series
# needs to first be converted to a list

0    5
dtype: int64

In [58]:
# Solution 1
pd.Series([i for i in ser1 if i not in list(ser2)])

0    1
1    2
2    3
dtype: int64

In [62]:
# Solution 2
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

### 7. How to get the items not common to both series A and series B?
Difficulty Level: L2

Get all items of ser1 and ser2 not common to both.

In [63]:
# Input

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [69]:
# Solution 1 
ser1[~ser1.isin(ser2)].append(ser2[~ser2.isin(ser1)])

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

In [70]:
# Solution 1
ser_u = pd.Series(np.union1d(ser1,ser2)) # np.union1d()
ser_i = pd.Series(np.intersect1d(ser1,ser2)) # np.intersect1d()
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

### 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
Difficuty Level: L2

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

In [72]:
# Input

ser = pd.Series(np.random.normal(10, 5, 25))

In [77]:
# Solution 1
np.percentile(ser, [0, 0.25, 0.5, 0.75, 1])

array([-1.81890703, -1.77071875, -1.72253046, -1.67434218, -1.62615389])

In [80]:
# Solution 2
ser.quantile([0, 0.25, 0.5, 0.75, 1])

0.00    -1.818907
0.25     4.803858
0.50     7.330702
0.75    13.739595
1.00    17.997324
dtype: float64

### 9. How to get frequency counts of unique items of a series?
Difficulty Level: L1

Calculte the frequency counts of each unique value ser.

In [81]:
# Input

ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [84]:
ser.value_counts()

e    8
a    6
b    4
g    3
h    3
f    3
d    2
c    1
dtype: int64

### 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
Difficulty Level: L2


From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

In [102]:
# Input

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
ser

0     3
1     3
2     1
3     1
4     2
5     1
6     2
7     1
8     4
9     2
10    4
11    4
dtype: int64

In [103]:
ser[~ser.isin(ser.value_counts().index[:2])] = 'Others'
ser

0     Others
1     Others
2          1
3          1
4     Others
5          1
6     Others
7          1
8          4
9     Others
10         4
11         4
dtype: object

### 11. How to bin a numeric series to 10 groups of equal size?
Difficulty Level: L2

Bin the series ser into 10 equal deciles and replace the values with the bin name.

In [104]:
# Input

ser = pd.Series(np.random.random(20))
# Desired Output

# First 5 items
# 0    7th
# 1    9th
# 2    7th
# 3    3rd
# 4    8th
# dtype: category
# Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

In [117]:
pd.qcut(ser, q=10, labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head(2)

0    2nd
1    5th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

### 12. How to convert a numpy array to a dataframe of given shape? (L1)
Difficulty Level: L1

Reshape the series ser into a dataframe with 7 rows and 5 columns

In [119]:
# Input

ser = pd.Series(np.random.randint(1, 10, 35))
ser.head()

0    1
1    4
2    1
3    9
4    9
dtype: int64

In [124]:
pd.DataFrame(ser.values.reshape(7,5)).head()

   0  1  2  3  4
0  1  4  1  9  9
1  4  1  6  6  6
2  7  2  6  5  8
3  4  4  8  7  2
4  2  9  6  8  9

### 13. How to find the positions of numbers that are multiples of 3 from a series?
Difficulty Level: L2


Find the positions of numbers that are multiples of 3 from ser.

In [133]:
# Input

ser = pd.Series(np.random.randint(1, 10, 7))

In [135]:
ser[ser % 3 == 0].index

Int64Index([1, 5, 6], dtype='int64')

### 14. How to extract items at given positions from a series
Difficulty Level: L1

From ser, extract the items at positions in list pos.

In [140]:
# Input

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [142]:
ser.loc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

### 15. How to stack two series vertically and horizontally ?
Difficulty Level: L1

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

In [143]:
# Input

ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [152]:
pd.concat([ser1,ser2]).to_frame()

   0
0  0
1  1
2  2
3  3
4  4
0  a
1  b
2  c
3  d
4  e

In [149]:
pd.concat([ser1,ser2], axis=1)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

### 16. How to get the positions of items of series A in another series B?
Difficulty Level: L2

Get the positions of items of ser2 in ser1 as a list.

In [153]:
# Input

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [169]:
# Solution 1

[np.argwhere(ser1.values == i)[0,0] for i in ser2]

[5, 4, 0, 8]

In [182]:
# Solution 2

[np.where(ser1 == i)[0][0] for i in ser2]

[5, 4, 0, 8]

### 17. How to compute the mean squared error on a truth and predicted series?
Difficulty Level: L2

Compute the mean squared error of truth and pred series.

In [183]:
# Input

truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [184]:
np.mean((truth - pred)**2)

0.31190697545738433

### 18. How to convert the first character of each element in a series to uppercase?
Difficulty Level: L2

Change the first character of each word to upper case in each word of ser.

In [189]:
# Input

ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [193]:
pd.Series([word[0].upper() + word[1:] for word in ser])

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [195]:
pd.Series([word.title() for word in ser]) # title() makes the first letter in each word uppercase

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [194]:
ser.map(lambda x: x.title())

0     How
1      To
2    Kick
3    Ass?
dtype: object

### 19. How to calculate the number of characters in each word in a series?
Difficulty Level: L2

In [196]:
# Input

ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [197]:
[len(word) for word in ser]

[3, 2, 4, 4]

### 20. How to compute difference of differences between consequtive numbers of a series?
Difficulty Level: L1

Difference of differences between the consequtive numbers of ser.

In [198]:
# Input

ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Desired Output

# [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
# [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [207]:
print(ser.diff().tolist()) # diff() calculates the diff compared with an other element
print(ser.diff().diff().tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

### 21. How to convert a series of date-strings to a timeseries?
Difficiulty Level: L2

In [208]:
# Input

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
# Desired Output

# 0   2010-01-01 00:00:00
# 1   2011-02-02 00:00:00
# 2   2012-03-03 00:00:00
# 3   2013-04-04 00:00:00
# 4   2014-05-05 00:00:00
# 5   2015-06-06 12:20:00
# dtype: datetime64[ns]

In [213]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

### 22. How to get the day of month, week number, day of year and day of week from a series of date strings?
Difficiulty Level: L2

Get the day of month, week number, day of year and day of week from ser.

In [237]:
# Input

ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
# Desired output

# Date:  [1, 2, 3, 4, 5, 6]
# Week number:  [53, 5, 9, 14, 19, 23]
# Day num of year:  [1, 33, 63, 94, 125, 157]
# Day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

In [259]:
ser = pd.to_datetime(ser)
# Series.dt() -> Accessor object for datetimelike properties of the Series values.
print(ser.dt.day.tolist()) # dt.day
print(ser.dt.isocalendar().week.tolist()) # dt.isocalendar().week
print(ser.dt.dayofyear.tolist()) # dt.dayofyear
print(ser.dt.day_name().tolist()) # dt.day_name()

[1, 2, 3, 4, 5, 6]
[53, 5, 9, 14, 19, 23]
[1, 33, 63, 94, 125, 157]
['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

### 23. How to convert year-month string to dates corresponding to the 4th day of the month?
Difficiulty Level: L2


Change ser to dates that start with 4th of the respective months.

In [260]:
# Input

ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])
# Desired Output

# 0   2010-01-04
# 1   2011-02-04
# 2   2012-03-04
# dtype: datetime64[ns]

In [265]:
pd.to_datetime('04 ' + ser)

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

### 24. How to filter words that contain atleast 2 vowels from a series?
Difficiulty Level: L3

From ser, extract words that contain atleast 2 vowels.

In [266]:
# Input

ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

# Desired Output

# 0     Apple
# 1    Orange
# 4     Money
# dtype: object

In [288]:
m = [True if len([letter for letter in word.lower() if letter in 'aeiou']) > 1 else False for word in ser]
ser[m]

0     Apple
1    Orange
4     Money
dtype: object

### 25. How to filter valid emails from a series?
Difficiulty Level: L3

Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

In [294]:
# Input

emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

# Desired Output

# 1    rameses@egypt.com
# 2            matt@t.co
# 3    narendra@modi.com
# dtype: object

In [310]:
# Solution 1
import re
mask = [bool(re.match(pattern, email)) for email in emails]
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

In [311]:
# Solution 1
m = emails.str.contains(pattern).tolist()
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

### 26. How to get the mean of a series grouped by another series?
Difficiulty Level: L2

Compute the mean of weights of each fruit.

In [319]:
# Input

fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())
#> [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
#> ['banana', 'carrot', 'apple', 'carrot', 'carrot', 'apple', 'banana', 'carrot', 'apple', 'carrot']
# Desired output

# values can change due to randomness
# apple     6.0
# banana    4.0
# carrot    5.8
# dtype: float64

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['apple', 'carrot', 'banana', 'banana', 'banana', 'banana', 'carrot', 'apple', 'carrot', 'banana']

In [321]:
weights.groupby(fruit).mean() # no need to use dataframe

apple     4.5
banana    5.6
carrot    6.0
dtype: float64

### 27. How to compute the euclidean distance between two series?
Difficiulty Level: L2

Compute the euclidean distance between series (points) p and q, without using a packaged formula.

In [323]:
# Input

p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

# Desired Output

# 18.165

In [329]:
np.sqrt(((p - q)**2).sum())

18.16590212458495

### 28. How to find all the local maxima (or peaks) in a numeric series?
Difficiulty Level: L3

Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

In [330]:
# Input

ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
# Desired output

# array([1, 5, 7])

In [344]:
ser[(ser.diff(-1) > 0) & (ser.diff(1) > 0)]

1    10
5    10
7     7
dtype: int64

### 29. How to replace missing spaces in a string with the least frequent character?
Replace the spaces in my_str with the least frequent character.

Difficiulty Level: L2

In [961]:
# Input

my_str = 'dbc deb abed gade'
# Desired Output

# 'dbccdebcabedcgade'  # least frequent is 'c'

In [368]:
ser = pd.Series(list('dbc deb abed gade')) # string to list to Series
freq = ser.value_counts()
least_freq = freq.dropna().index[-1]
my_str.replace(' ', least_freq)

'dbcgdebgabedggade'

### 30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?
Difficiulty Level: L2

In [369]:
# Desired output


# values can be random
# 2000-01-01    4
# 2000-01-08    1
# 2000-01-15    8
# 2000-01-22    4
# 2000-01-29    4
# 2000-02-05    2
# 2000-02-12    4
# 2000-02-19    9
# 2000-02-26    6
# 2000-03-04    6

In [382]:
pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
# pd.date_range(start, end, periods, freq)

2000-01-01    7
2000-01-08    3
2000-01-15    7
2000-01-22    5
2000-01-29    8
2000-02-05    6
2000-02-12    4
2000-02-19    3
2000-02-26    1
2000-03-04    9
Freq: W-SAT, dtype: int64

### 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
Difficiulty Level: L2

ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

In [4]:
# Input

ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)
#> 2000-01-01     1.0
#> 2000-01-03    10.0
#> 2000-01-06     3.0
#> 2000-01-08     NaN
#> dtype: float64

# Desired Output

# 2000-01-01     1.0
# 2000-01-02     1.0
# 2000-01-03    10.0
# 2000-01-04    10.0
# 2000-01-05    10.0
# 2000-01-06     3.0
# 2000-01-07     3.0
# 2000-01-08     3.0

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [27]:
ser.resample('D').ffill()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

### 32. How to compute the autocorrelations of a numeric series?
Difficiulty Level: L3

Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

In [88]:
# Input

ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

# Desired output

# values will change due to randomness
# [0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]
# Lag having highest correlation:  9

In [89]:
np.argmax([ser.autocorr(i) for i in range(1,11)])

3

### 33. How to import only every nth row from a csv file to create a dataframe?
Difficiulty Level: L2

Import every 50th row of BostonHousing dataset as a dataframe.

In [110]:
df_chunks = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.DataFrame()

In [111]:
for df_chunk in df_chunks:
    df2 = df2.append(df_chunk.iloc[0, :])

In [112]:
df2.head()

,age,b,chas,crim,dis,indus,lstat,medv,nox,ptratio,rad,rm,tax,zn
0,65.2,396.90,0.0,0.00632,4.0900,2.31,4.98,24.0,0.538,15.3,1.0,6.575,296.0,18.0
50,45.7,395.56,0.0,0.08873,6.8147,5.64,13.45,19.7,0.439,16.8,4.0,5.963,243.0,21.0
100,79.9,394.76,0.0,0.14866,2.7778,8.56,9.42,27.5,0.520,20.9,5.0,6.727,384.0,0.0
150,97.3,372.80,0.0,1.65660,1.6180,19.58,14.10,21.5,0.871,14.7,5.0,6.122,403.0,0.0
200,13.9,384.30,0.0,0.01778,7.6534,1.47,4.45,32.9,0.403,17.0,3.0,7.135,402.0,95.0

### 34. How to change column values when importing csv to a dataframe?
Difficulty Level: L2

Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

In [115]:
df = pd.read_csv(
    'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv',
    converters = {'medv': lambda x: 'High' if float(x) > 25 else 'Low'}
) # Dict of functions to convert values in certain columns

### 35. How to create a dataframe with rows as strides from a given series?
Difficiulty Level: L3

In [117]:
# Input

L = pd.Series(range(15))

# Desired Output

# array([[ 0,  1,  2,  3],
#        [ 2,  3,  4,  5],
#        [ 4,  5,  6,  7],
#        [ 6,  7,  8,  9],
#        [ 8,  9, 10, 11],
#        [10, 11, 12, 13]])

In [126]:
L

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int64

### 36. How to import only specified columns from a csv file?
Difficulty Level: L1

Import ‘crim’ and ‘medv’ columns of the BostonHousing dataset as a dataframe.

In [128]:
df = pd.read_csv(
    'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv',
    usecols = ['crim', 'medv']
)
df.head(2)

      crim  medv
0  0.00632  24.0
1  0.02731  21.6

### 37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.
Difficulty Level: L2

Get the number of rows, columns, datatype and summary statistics of each column of the Cars93 dataset. Also get the numpy array and list equivalent of the dataframe.

In [129]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [136]:
df.shape

(93, 27)

In [137]:
df.dtypes

Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object

In [138]:
df.describe()

,Min.Price,Price,Max.Price,MPG.city,MPG.highway,EngineSize,Horsepower,RPM,Rev.per.mile,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight
count,86.000000,91.000000,88.000000,84.000000,91.000000,91.000000,86.000000,90.000000,87.000000,85.000000,91.000000,89.000000,92.000000,87.000000,88.000000,89.000000,74.000000,86.000000
mean,17.118605,19.616484,21.459091,22.404762,29.065934,2.658242,144.000000,5276.666667,2355.000000,16.683529,5.076923,182.865169,103.956522,69.448276,38.954545,27.853933,13.986486,3104.593023
std,8.828290,9.724280,10.696563,5.841520,5.370293,1.045845,53.455204,605.554811,486.916616,3.375748,1.045953,14.792651,6.856317,3.778023,3.304157,3.018129,3.120824,600.129993
min,6.700000,7.400000,7.900000,15.000000,20.000000,1.000000,55.000000,3800.000000,1320.000000,9.200000,2.000000,141.000000,90.000000,60.000000,32.000000,19.000000,6.000000,1695.000000
25%,10.825000,12.350000,14.575000,18.000000,26.000000,1.800000,100.750000,4800.000000,2017.500000,14.500000,4.000000,174.000000,98.000000,67.000000,36.000000,26.000000,12.000000,2647.500000
50%,14.600000,17.700000,19.150000,21.000000,28.000000,2.300000,140.000000,5200.000000,2360.000000,16.500000,5.000000,181.000000,103.000000,69.000000,39.000000,27.500000,14.000000,3085.000000
75%,20.250000,23.500000,24.825000,25.000000,31.000000,3.250000,170.000000,5787.500000,2565.000000,19.000000,6.000000,192.000000,110.000000,72.000000,42.000000,30.000000,16.000000,3567.500000
max,45.400000,61.900000,80.000000,46.000000,50.000000,5.700000,300.000000,6500.000000,3755.000000,27.000000,8.000000,219.000000,119.000000,78.000000,45.000000,36.000000,22.000000,4105.000000

In [141]:
# Array
df_arr = df.values

# List
df_list = df.values.tolist()

### 38. How to extract the row and column number of a particular cell with given criterion?
Difficulty Level: L1

In [144]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Which manufacturer, model and type has the highest Price? 
# What is the row and column number of the cell with the highest Price value?

In [156]:
# Get manufacuter. model and type
row_idx = df['Price'].argmax()
df.iloc[row_idx][['Manufacturer', 'Model','Type']]

Manufacturer    Mercedes-Benz
Model                    300E
Type                  Midsize
Name: 58, dtype: object

In [169]:
df.loc[0, 'MPG.city'] = 61.9
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,61.9,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

### 39. How to rename a specific columns in a dataframe?
Difficulty Level: L2

Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.

In [172]:
#Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
# print(df.columns)
#> Index(['Manufacturer', 'Model', 'Type', 'Min.Price', 'Price', 'Max.Price',
#>        'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders',
#>        'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail',
#>        'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
#>        'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin',
#>        'Make'],
#>       dtype='object')

# Desired Solution

# print(df.columns)
#> Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
#>        'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
#>        'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
#>        'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
#>        'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
#>        'Make'],
#>       dtype='object')

In [173]:
df = df.rename(columns={'Type':'CarType'})
df.columns = [col.replace('.','_') for col in df.columns]
print(df.columns)

Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

### 40. How to check if a dataframe has any missing values?
Difficulty Level: L1

Check if df has any missing values.

In [174]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [181]:
df.isnull().values.any()

True

### 41. How to count the number of missing values in each column?
Difficulty Level: L2


Count the number of missing values in each column of df. Which column has the maximum number of missing values?

In [188]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [199]:
col_idx = df.isnull().sum().argmax()
df.columns[col_idx]

'Luggage.room'

### 42. How to replace missing values of multiple numeric columns with the mean?
Difficulty Level: L2

Replace missing values in Min.Price and Max.Price columns with their respective mean.

In [259]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [260]:
df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].apply(lambda x: x.fillna(x.mean()))

### 43. How to use apply function on existing columns with global variables as additional arguments?
Difficulty Level: L3

In df, use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

In [263]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [276]:
d = {'Min.Price':np.nanmean, 'Max.Price':np.nanmedian}
df[['Min.Price', 'Max.Price']].apply(lambda x, d: x.fillna(d[x.name](x)), args=(d,))

    Min.Price  Max.Price
0   12.900000      18.80
1   29.200000      38.70
2   25.900000      32.30
3   17.118605      44.60
4   17.118605      19.15
..        ...        ...
88  16.600000      22.70
89  17.600000      22.40
90  22.900000      23.70
91  21.800000      23.50
92  24.800000      28.50

[93 rows x 2 columns]

### 44. How to select a specific column from a dataframe as a dataframe instead of a series?
Difficulty Level: L2

Get the first column (a) in df as a dataframe (rather than as a Series).

In [277]:
# Input

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [279]:
df[['a']]

    a
0   0
1   5
2  10
3  15

### 45. How to change the order of columns of a dataframe?
Difficulty Level: L3

Actually 3 questions.

1. In df, interchange columns 'a' and 'c'.
2. Create a generic function to interchange two columns, without hardcoding column names.
3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

In [304]:
# Input

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df.head(2)

   a  b  c  d  e
0  0  1  2  3  4
1  5  6  7  8  9

In [291]:
# 1
temp_col = df['a'].copy()
df['a'] = df['b']
df['b'] = temp_col
df = df.rename(columns={'a':'b', 'b':'a'})
df.head(2)

   b  a  c  d  e
0  1  0  2  3  4
1  6  5  7  8  9

In [295]:
# 2
def interchange_columns(df, col_1, col_2):
    temp_col = df[col_1].copy()
    df[col_1] = df[col_2]
    df[col_2] = temp_col
    return df.rename(columns={col_1:col_2, col_2:col_1})
interchange_columns(df, 'a', 'b').head(2)

   b  a  c  d  e
0  1  0  2  3  4
1  6  5  7  8  9

In [328]:
# 3
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[sorted(df.columns, reverse=True)]

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

### 46. How to set the number of rows and columns displayed in the output?
Difficulty Level: L2

Change the pandas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.

In [329]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [337]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

In [339]:
pd.describe_option()

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
compute.use_numba : bool
    Use the numba engine option for select operations if it is installed,
    the default is False
    Valid values: False,True
    [default: False] [currently: False]
compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
display.chop_threshold : float or None
    if set to a float value, all float values smaller then the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]
display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]
display.column_space No description available.
    [default: 12] [currently: 12]
display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]
display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]
display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]
display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]
display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]
display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]
display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]
display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]
display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table (the default from 0.13), or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]
display.latex.escape : bool
    This specifies if the to_latex method of a Dataframe uses escapes special
    characters.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.longtable :bool
    This specifies if the to_latex method of a Dataframe uses the longtable
    format.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.multicolumn : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.multicolumn_format : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: l] [currently: l]
display.latex.multirow : bool
    This specifies if the to_latex method of a Dataframe uses multirows
    to pretty-print MultiIndex rows.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.repr : boolean
    Whether to produce a latex DataFrame representation for jupyter
    environments that support it.
    (default: False)
    [default: False] [currently: False]
display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]
display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 10]
display.max_colwidth : int or None
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output. A 'None' value means unlimited.
    [default: 50] [currently: 50]
display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]
display.max_info_rows : int or None
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]
display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 10]
display.max_seq_items : int or None
    when pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]
display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]
display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]
display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]
display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]
display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]
display.precision : int
    Floating point output precision (number of significant digits). This is
    only a suggestion
    [default: 6] [currently: 6]
display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]
display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 80]
io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.ods.writer : string
    The default Excel writer engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd.
    [default: auto] [currently: auto]
io.excel.xls.writer : string
    The default Excel writer engine for 'xls' files. Available options:
    auto, xlwt.
    [default: auto] [currently: auto]
io.excel.xlsb.reader : string
    The default Excel reader engine for 'xlsb' files. Available options:
    auto, pyxlsb.
    [default: auto] [currently: auto]
io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]
io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]
io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]
io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]
mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]
mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]
mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).
    [default: False] [currently: False]
mode.use_inf_as_null : boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.
    [default: False] [currently: False]
    (Deprecated, use `mode.use_inf_as_na` instead.)
plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    providing the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]
plotting.matplotlib.register_converters : bool or 'auto'.
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: auto] [currently: auto]

### 47. How to format or suppress scientific notations in a pandas dataframe?
Difficulty Level: L2

Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.

In [341]:
# Input

df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
df
#>          random
#> 0  3.474280e-03
#> 1  3.951517e-05
#> 2  7.469702e-02
#> 3  5.541282e-28

# Desired Output

#>    random
#> 0  0.0035
#> 1  0.0000
#> 2  0.0747
#> 3  0.0000

         random
0  5.558236e-01
1  5.786154e-07
2  1.520461e-09
3  7.258986e-02

In [349]:
# Solution 1
df['random'].round(4)

0    0.5558
1    0.0000
2    0.0000
3    0.0726
Name: random, dtype: float64

In [357]:
pd.describe_option()

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
compute.use_numba : bool
    Use the numba engine option for select operations if it is installed,
    the default is False
    Valid values: False,True
    [default: False] [currently: False]
compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
display.chop_threshold : float or None
    if set to a float value, all float values smaller then the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]
display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]
display.column_space No description available.
    [default: 12] [currently: 12]
display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]
display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]
display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]
display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]
display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: <function <lambda> at 0x7f0c57afd840>]
display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]
display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]
display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]
display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table (the default from 0.13), or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]
display.latex.escape : bool
    This specifies if the to_latex method of a Dataframe uses escapes special
    characters.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.longtable :bool
    This specifies if the to_latex method of a Dataframe uses the longtable
    format.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.multicolumn : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.multicolumn_format : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: l] [currently: l]
display.latex.multirow : bool
    This specifies if the to_latex method of a Dataframe uses multirows
    to pretty-print MultiIndex rows.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.repr : boolean
    Whether to produce a latex DataFrame representation for jupyter
    environments that support it.
    (default: False)
    [default: False] [currently: False]
display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]
display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 10]
display.max_colwidth : int or None
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output. A 'None' value means unlimited.
    [default: 50] [currently: 50]
display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]
display.max_info_rows : int or None
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]
display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 10]
display.max_seq_items : int or None
    when pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]
display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]
display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]
display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]
display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]
display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]
display.precision : int
    Floating point output precision (number of significant digits). This is
    only a suggestion
    [default: 6] [currently: 6]
display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]
display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 80]
io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.ods.writer : string
    The default Excel writer engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd.
    [default: auto] [currently: auto]
io.excel.xls.writer : string
    The default Excel writer engine for 'xls' files. Available options:
    auto, xlwt.
    [default: auto] [currently: auto]
io.excel.xlsb.reader : string
    The default Excel reader engine for 'xlsb' files. Available options:
    auto, pyxlsb.
    [default: auto] [currently: auto]
io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]
io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]
io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]
io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]
mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]
mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]
mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).
    [default: False] [currently: False]
mode.use_inf_as_null : boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.
    [default: False] [currently: False]
    (Deprecated, use `mode.use_inf_as_na` instead.)
plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    providing the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]
plotting.matplotlib.register_converters : bool or 'auto'.
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: auto] [currently: auto]

In [356]:
# Solution 2
pd.set_option('display.float_format', lambda x: '%.4f' % x)
df['random']

0   0.5558
1   0.0000
2   0.0000
3   0.0726
Name: random, dtype: float64

### 48. How to format all the values in a dataframe as percentages?
Difficulty Level: L2

Format the values in column 'random' of df as percentages.

In [967]:
# Input

df = pd.DataFrame(np.random.random(4), columns=['random'])
df
#>      random
#> 0    .689723
#> 1    .957224
#> 2    .159157
#> 3    .21082

# Desired Output

#>      random
#> 0    68.97%
#> 1    95.72%
#> 2    15.91%
#> 3    2.10%

   random
0  0.4430
1  0.4451
2  0.2087
3  0.3093

In [373]:
df['random'].apply(lambda x: '{:.2%}'.format(x))
# {}
# {:}
# {:.2}
# {:.2%}

0    32.14%
1    94.67%
2    40.25%
3     6.88%
Name: random, dtype: object

### 49. How to filter every nth row in a dataframe?
Difficulty Level: L1

From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

In [374]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [386]:
df.iloc[::20][['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

### 50. How to create a primary key index by combining relevant columns?
Difficulty Level: L2

In df, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

In [387]:
# Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])

# Desired Output

#                        Manufacturer    Model     Type  Min.Price  Max.Price
# Acura_Integra_Small           Acura  Integra    Small       12.9       18.8
# missing_Legend_Midsize      missing   Legend  Midsize       29.2       38.7
# Audi_90_Compact                Audi       90  Compact       25.9       32.3
# Audi_100_Midsize               Audi      100  Midsize        NaN       44.6
# BMW_535i_Midsize                BMW     535i  Midsize        NaN        NaN

In [390]:
df[['Manufacturer', 'Model', 'Type']] = df[['Manufacturer', 'Model', 'Type']].fillna('missing')
df.index = df['Manufacturer'] + '_' + df['Model'] + '_' + df['Type']

In [393]:
df.head(3)

                       Manufacturer    Model     Type  Min.Price  Max.Price
Acura_Integra_Small           Acura  Integra    Small    12.9000    18.8000
missing_Legend_Midsize      missing   Legend  Midsize    29.2000    38.7000
Audi_90_Compact                Audi       90  Compact    25.9000    32.3000

### 51. How to get the row number of the nth largest value in a column?
Difficulty Level: L2

Find the row position of the 5th largest value of column 'a' in df.

In [394]:
# Input

df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

In [422]:
# Solution 1
df['a'].sort_values(ascending=False).index[4]

0

In [430]:
# Solution 2

df['a'].argsort()[::-1][5] # argsort()

0

### 52. How to find the position of the nth largest value greater than a given value?
Difficulty Level: L2

In ser, find the position of the 2nd largest value greater than the mean.

In [431]:
# Input

ser = pd.Series(np.random.randint(1, 100, 15))

In [462]:
ser[ser > ser.mean()].reset_index(drop=True).argsort()[1]

1

### 53. How to get the last n rows of a dataframe with row sum > 100?
Difficulty Level: L2

Get the last two rows of df whose row sum is greater than 100.

In [463]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

In [467]:
df[df.sum(axis=1) > 100].tail(2)

     0   1   2   3
11  11  21  36  34
13  34  30  23  14

### 54. How to find and cap outliers from a series or dataframe column?
Difficulty Level: L2

Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

In [479]:
# Input

ser = pd.Series(np.logspace(-2, 2, 30))

In [481]:
ser.loc[ser < ser.quantile(.05)] = ser.quantile(.05)
ser.loc[ser > ser.quantile(.95)] = ser.quantile(.95)

### 55. How to reshape a dataframe to the largest possible square after removing the negative values?
Difficulty Level: L3

Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. The order of the positive numbers in the result should remain the same as the original.

In [577]:
# Input

df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
df

    0   1   2   3   4   5   6   7   8   9
0  16  27  25  18  44  -1  14  -3  42  15
1  15  28  44 -13  -1  31  47  -1   0  -3
2 -11  48  33  19  27   1  43 -15  43   8
3  11 -10  28 -17   3  33  38 -17 -18  35
4 -13  45   6  -7  49   5 -16  45  16  27
5  17  40  11 -14  12  43  48  16  -2   7
6  -3  41  30 -13  -3 -14  27  47  33 -18
7  48  30 -15  48  36  -8  17 -17  37  -5
8  41 -17  -6  33   4  35  38  -9 -15 -15
9  29   4  46  20   1  49  -8  18  -9  30

In [578]:
arr = df[df > 0].values.flatten()
arr = arr[~np.isnan(arr)]

In [585]:
n = int(np.sqrt(len(arr)))
n_remove = len(arr) - n**2
indexes = np.argsort(arr)[n_remove:]
df = pd.DataFrame(np.take(arr, sorted(indexes)).reshape(n,n))
df

        0       1       2       3       4       5       6       7
0 16.0000 27.0000 25.0000 18.0000 44.0000 14.0000 42.0000 15.0000
1 15.0000 28.0000 44.0000 31.0000 47.0000 48.0000 33.0000 19.0000
2 27.0000 43.0000 43.0000  8.0000 11.0000 28.0000  3.0000 33.0000
3 38.0000 35.0000 45.0000  6.0000 49.0000  5.0000 45.0000 16.0000
4 27.0000 17.0000 40.0000 11.0000 12.0000 43.0000 48.0000 16.0000
5  7.0000 41.0000 30.0000 27.0000 47.0000 33.0000 48.0000 30.0000
6 48.0000 36.0000 17.0000 37.0000 41.0000 33.0000  4.0000 35.0000
7 38.0000 29.0000  4.0000 46.0000 20.0000 49.0000 18.0000 30.0000

### 56. How to swap two rows of a dataframe?
Difficulty Level: L2

Swap rows 1 and 2 in df.

In [591]:
# Input

df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [592]:
temp = df.iloc[0].copy()
df.iloc[0] = df.iloc[1]
df.iloc[1] = temp
df

    0   1   2   3   4
0   5   6   7   8   9
1   0   1   2   3   4
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

### 57. How to reverse the rows of a dataframe?
Difficulty Level: L2

Reverse all the rows of dataframe df.

In [596]:
# Input

df = pd.DataFrame(np.arange(25).reshape(5, -1))

In [605]:
# Solution 1
df.iloc[list(df.index)[::-1]].reset_index(drop=True)

    0   1   2   3   4
0  20  21  22  23  24
1  15  16  17  18  19
2  10  11  12  13  14
3   5   6   7   8   9
4   0   1   2   3   4

In [606]:
# Solution 2

df.iloc[::-1, :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

### 58. How to create one-hot encodings of a categorical variable (dummy variables)?
Difficulty Level: L2

Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

In [607]:
# Input

df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))

#     a   b   c   d   e
# 0   0   1   2   3   4
# 1   5   6   7   8   9
# 2  10  11  12  13  14
# 3  15  16  17  18  19
# 4  20  21  22  23  24

# Output

#    0  5  10  15  20   b   c   d   e
# 0  1  0   0   0   0   1   2   3   4
# 1  0  1   0   0   0   6   7   8   9
# 2  0  0   1   0   0  11  12  13  14
# 3  0  0   0   1   0  16  17  18  19
# 4  0  0   0   0   1  21  22  23  24

In [618]:
pd.concat([pd.get_dummies(df['a']), df.drop(columns='a')], axis=1)

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

### 59. Which column contains the highest number of row-wise maximum values?
Difficulty Level: L2

Obtain the column name with the highest number of row-wise maximum’s in df.

In [643]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
df

    0   1   2   3
0  64  78  64  51
1  89  95  46   2
2  24  84  36  86
3  89  19  83   9
4  25  46   2  13
5  68  17  91  74
6   5  33  73  81
7  90  27  61  60
8  76  16  48  52
9  82  46  98  35

In [644]:
row_max = np.max(df, axis=1)
(df == row_max).sum().argmax()

1

### 60. How to create a new column that contains the row number of nearest column by euclidean distance?
Create a new column such that, each row contains the row number of nearest row-record by euclidean distance. Difficulty Level: L3

In [645]:
# Input

df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
# df
#     p   q   r   s
# a  57  77  13  62
# b  68   5  92  24
# c  74  40  18  37
# d  80  17  39  60
# e  93  48  85  33
# f  69  55   8  11
# g  39  23  88  53
# h  63  28  25  61
# i  18   4  73   7
# j  79  12  45  34

# Desired Output

# df
#    p   q   r   s nearest_row   dist
# a  57  77  13  62           i  116.0
# b  68   5  92  24           a  114.0
# c  74  40  18  37           i   91.0
# d  80  17  39  60           i   89.0
# e  93  48  85  33           i   92.0
# f  69  55   8  11           g  100.0
# g  39  23  88  53           f  100.0
# h  63  28  25  61           i   88.0
# i  18   4  73   7           a  116.0
# j  79  12  45  34           a   81.0

In [675]:
for i in df.index:
    dists = np.sqrt(((df - df.loc[i])**2).sum(axis=1)).drop(i)
    min_dist, argmin_dist = dists.min(), dists.argmin()
    df.loc[i, ['dist', 'nearest_row']] = min_dist, argmin_dist

### 61. How to know the maximum possible correlation value of each column against other columns?
Difficulty Level: L2 Compute maximum possible absolute correlation value of each column against other columns in df.

In [739]:
# Input

df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))

In [711]:
def corr(x, y):
    x_mean, y_mean = x.mean(), y.mean()
    x_mean_diff, y_mean_diff = x - x_mean, y - y_mean
    corr =  (x_mean_diff * y_mean_diff).sum() / np.sqrt((x_mean_diff**2).sum() * (y_mean_diff**2).sum())
    return corr

In [740]:
df

    p   q   r   s   t   u   v   w   x   y
a  86  36  15  28  84  78  59  75  39  20
b  68  56  52  19  61  35   4   8  47  31
c  82  31  77  80   7  36  60   1  47  83
d  64  70  52  59  68  98  17  76  87  49
e  17  23  36  30  78  97  87  10   5  95
f  11  81  66  29  35  15  77  80  53  57
g  82  67  50  85  57  98  21   6   1  86
h   3  39  17  22  86  40  96  11  47  49

In [752]:
df_mean_diff = df - df.mean()
for i in df.columns:
    corr = df.mul(df_mean_diff[i], axis=0).sum() / np.sqrt((df_mean_diff[i]**2).sum() * (df_mean_diff**2).sum())
    max_corr = corr.drop(i).max()
    df.loc['max_corr', i] = max_corr

In [753]:
df

,p,q,r,s,t,u,v,w,x,y
a,86.0000,36.0000,15.0000,28.0000,84.0000,78.0000,59.0000,75.0000,39.0000,20.0000
b,68.0000,56.0000,52.0000,19.0000,61.0000,35.0000,4.0000,8.0000,47.0000,31.0000
c,82.0000,31.0000,77.0000,80.0000,7.0000,36.0000,60.0000,1.0000,47.0000,83.0000
d,64.0000,70.0000,52.0000,59.0000,68.0000,98.0000,17.0000,76.0000,87.0000,49.0000
e,17.0000,23.0000,36.0000,30.0000,78.0000,97.0000,87.0000,10.0000,5.0000,95.0000
f,11.0000,81.0000,66.0000,29.0000,35.0000,15.0000,77.0000,80.0000,53.0000,57.0000
g,82.0000,67.0000,50.0000,85.0000,57.0000,98.0000,21.0000,6.0000,1.0000,86.0000
h,3.0000,39.0000,17.0000,22.0000,86.0000,40.0000,96.0000,11.0000,47.0000,49.0000
max_corr,0.6662,0.6269,0.6711,0.6984,0.6567,0.6558,0.4540,0.6135,0.6132,0.6975

### 62. How to create a column containing the minimum by maximum of each row?
Difficulty Level: L2 Compute the minimum-by-maximum for every row of df.

In [754]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [761]:
df.min(axis=1) / df.max(axis=1)

0   0.1667
1   0.0309
2   0.0521
3   0.0833
4   0.0189
5   0.0102
6   0.0674
7   0.0400
dtype: float64

### 63. How to create a column that contains the penultimate value in each row?
Difficulty Level: L2 Create a new column 'penultimate' which has the second largest value of each row of df. Input

In [794]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [795]:
df

    0   1   2   3   4   5   6   7   8   9
0  18  66  18  59  19  49  69  26  45  60
1  28  19  52  42  50  98  18  17  79  48
2  44  26  51  90  67  88  31  55  83  33
3  28  52  14  26  94  24  73  68  37  69
4  81  88  42  63   6  60  98  65  74  53
5  51  90  38  53   3  72  32  62  79  69
6  30  52  89  68  70  95  40  69  66  68
7  48  60  51  60  94  33  79  25  48  41

In [810]:
# Solution

df['scnd_largest'] = df.apply(lambda row: row.sort_values().unique()[-2], axis=1)
df

    0   1   2   3   4  ...   6   7   8   9  scnd_largest
0  18  66  18  59  19  ...  69  26  45  60            66
1  28  19  52  42  50  ...  18  17  79  48            79
2  44  26  51  90  67  ...  31  55  83  33            88
3  28  52  14  26  94  ...  73  68  37  69            73
4  81  88  42  63   6  ...  98  65  74  53            88
5  51  90  38  53   3  ...  32  62  79  69            79
6  30  52  89  68  70  ...  40  69  66  68            89
7  48  60  51  60  94  ...  79  25  48  41            79

[8 rows x 11 columns]

### 64. How to normalize all columns in a dataframe?
Difficulty Level: L2

Normalize all columns of df by subtracting the column mean and divide by standard deviation.
Range all columns of df such that the minimum value in each column is 0 and max is 1.
Don’t use external packages like sklearn.

In [813]:
# Input

df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [815]:
df = (df - df.mean()) / df.std()
df = (df - df.min()) / (df.max()  - df.min())
df

       0      1      2      3      4      5      6      7      8      9
0 0.9767 0.5444 0.0000 0.4355 0.6437 0.3289 0.0667 0.0000 0.0455 0.1707
1 1.0000 1.0000 0.4184 0.5968 0.2299 0.6316 0.0533 0.5773 0.6136 0.4878
2 0.1047 0.8000 0.7449 0.0000 0.1954 0.0000 0.4667 1.0000 0.0227 1.0000
3 0.9070 0.8889 1.0000 0.8548 0.8161 0.1711 0.9867 0.5464 1.0000 0.8780
4 0.5233 0.6333 0.8367 0.0000 0.5402 0.5395 0.7200 0.1031 0.9318 0.0000
5 0.0000 0.0000 0.6837 0.1935 0.2069 1.0000 0.1067 0.9072 0.1591 0.4512
6 0.9070 0.4667 0.5204 0.6452 1.0000 0.0000 1.0000 0.2784 0.4545 0.5244
7 0.7791 0.2000 0.7347 1.0000 0.0000 0.1316 0.0000 0.6701 0.0000 0.3049

### 65. How to compute the correlation of each row with the suceeding row?
Difficulty Level: L2 Compute the correlation of each row of df with its succeeding row.

In [829]:
# Input

df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [833]:
df

    0   1   2   3   4   5   6   7   8   9
0  34  60  91  69  44  14  84   9  59  16
1  61  67  74  61  80  79  88  45  75   4
2  19  94  97  72  19  60  72  63  80  12
3  49  13   1  53  67  46   1  44  70  21
4  86  39  83  75  60  94  13  46  76  45
5  29  66   9  28  25  40  37  26  16  20
6  68  17   5  92  77  32  75  47  76  16
7  66  86  94  42  13  12  29  84  31  47

In [838]:
# Solution

df_row_corr = df.T.corr()
corrs = []
for i in range(7):
    corrs.append(df_row_corr.loc[i, i + 1])
corrs

865 µs ± 11.7 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

### 66. How to replace both the diagonals of dataframe with 0?
Difficulty Level: L2

Replace both values in both diagonals of df with 0.

In [860]:
# Input

df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
# df
#     0   1   2   3   4   5   6   7   8   9
# 0  11  46  26  44  11  62  18  70  68  26
# 1  87  71  52  50  81  43  83  39   3  59
# 2  47  76  93  77  73   2   2  16  14  26
# 3  64  18  74  22  16  37  60   8  66  39
# 4  10  18  39  98  25   8  32   6   3  29
# 5  29  91  27  86  23  84  28  31  97  10
# 6  37  71  70  65   4  72  82  89  12  97
# 7  65  22  97  75  17  10  43  78  12  77
# 8  47  57  96  55  17  83  61  85  26  86
# 9  76  80  28  45  77  12  67  80   7  63

# Desired output

#     0   1   2   3   4   5   6   7   8   9
# 0   0  46  26  44  11  62  18  70  68   0
# 1  87   0  52  50  81  43  83  39   0  59
# 2  47  76   0  77  73   2   2   0  14  26
# 3  64  18  74   0  16  37   0   8  66  39
# 4  10  18  39  98   0   0  32   6   3  29
# 5  29  91  27  86   0   0  28  31  97  10
# 6  37  71  70   0   4  72   0  89  12  97
# 7  65  22   0  75  17  10  43   0  12  77
# 8  47   0  96  55  17  83  61  85   0  86
# 9   0  80  28  45  77  12  67  80   7   0

In [862]:
for i in range(len(df)):
    df.loc[i, i] = 0
    df.loc[len(df) - 1 - i, i] = 0

In [863]:
df

    0   1   2   3   4   5   6   7   8   9
0   0   3  64  70  24   5   7  82  30   0
1   1   0  74  14  57   7  97  10   0  62
2  46  75   0   6  11  24  27   0  81  22
3  90  65  77   0  83  82   0  90  82  48
4  12  27  41  91   0   0  91  20  66  24
5  63  23  86  98   0   0  66  87   3  86
6  11  56  60   0  15  20   0  65  90  43
7  39  73   0  39  96  56  48   0  45  94
8  48   0  62  78  44   3  26  26   0  94
9   0  88   1  28  72  46  94  56  41   0

### 67. How to get the particular group of a groupby dataframe by key?
Difficulty Level: L2 

This is a question related to understanding of grouped dataframe. From df_grouped, get the group belonging to 'apple' as a dataframe.

In [864]:
#Input

df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])

In [874]:
# Solution 1
df.groupby(['col1']).get_group('apple')

# Solution 2
for i, dff in df_grouped:
    if i == 'apple':
        print(dff)

    col1   col2  col3
0  apple 0.5106     7
3  apple 0.8439     6
6  apple 0.3137     0

### 68. How to get the n’th largest value of a column when grouped by another column?
Difficulty Level: L2 

In df, find the second largest value of 'taste' for 'banana'

In [879]:
#Input

df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

In [888]:
df_grouped = df.groupby('fruit')['rating']
df_grouped.get_group('banana').sort_values().iloc[-2]

0.13410874206656676

### 69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?
Difficulty Level: L1 

In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

In [890]:
# Input

df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

In [892]:
df.groupby('fruit', as_index=False)['price'].mean()

    fruit  price
0   apple 5.6667
1  banana 5.0000
2  orange 5.0000

### 70. How to join two dataframes by 2 columns so they have only the common rows?
Difficulty Level: L2 
    
Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

In [894]:
# Input

df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

In [895]:
pd.merge(df1, df2, left_on=['fruit','weight'], right_on=['pazham','kilo'], how='inner')

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high        6   apple  high       10
1   apple   high       14   apple  high       10
2   apple   high        5   apple  high       10
3  orange    low        8  orange   low       11
4  orange    low        6  orange   low       11
5  orange    low        9  orange   low       11

### 72. How to get the positions where values of two columns match?
Difficulty Level: L2

In [897]:
# Input
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                   'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})

In [900]:
df[df['fruit1'] == df['fruit2']]

   fruit1  fruit2
3  banana  banana

### 73. How to create lags and leads of a column in a dataframe?
Difficulty Level: L2 

Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column ‘a’ and the other is a lead1 (shift column b up by 1 row).

In [901]:
#Input

df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

#     a   b   c   d
# 0  66  34  76  47
# 1  20  86  10  81
# 2  75  73  51  28
# 3   1   1   9  83
# 4  30  47  67   4

# Desired Output

#     a   b   c   d  a_lag1  b_lead1
# 0  66  34  76  47     NaN     86.0
# 1  20  86  10  81    66.0     73.0
# 2  75  73  51  28    20.0      1.0
# 3   1   1   9  83    75.0     47.0
# 4  30  47  67   4     1.0      NaN

In [902]:
df['a_lag1'] = df['a'].shift(1)
df['b_lag1'] = df['b'].shift(-1)
df

    a   b   c   d  a_lag1  b_lag1
0  59  14  39  87     nan 42.0000
1  16  42  61  33 59.0000 12.0000
2  28  12  45  62 16.0000 95.0000
3  91  95  38  78 28.0000 85.0000
4  60  85   9  85 91.0000     nan

### 74. How to get the frequency of unique values in the entire dataframe?

Difficulty Level: L2 Get the frequency of unique values in the entire dataframe df.

In [903]:
# Input

df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

In [915]:
pd.value_counts(df.values.flatten())

9    4
7    4
8    3
3    3
2    2
1    2
6    1
5    1
dtype: int64

### 75. How to split a text column into two separate columns?
Difficulty Level: L2 Split the string column in df to form a dataframe with 3 columns as shown.

In [916]:
# Input

df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

print(df)

#>                         row
#> 0          STD, City\tState
#> 1  33, Kolkata\tWest Bengal
#> 2   44, Chennai\tTamil Nadu
#> 3  40, Hyderabad\tTelengana
#> 4  80, Bangalore\tKarnataka

# Desired Output

# 0 STD        City        State
# 1  33     Kolkata  West Bengal
# 2  44     Chennai   Tamil Nadu
# 3  40   Hyderabad    Telengana
# 4  80   Bangalore    Karnataka

                          row
0          STD, City    State
1  33, Kolkata    West Bengal
2   44, Chennai    Tamil Nadu
3  40, Hyderabad    Telengana
4  80, Bangalore    Karnataka